ws/resources/objectRepo/xmlTemplates/INT/IntegrationProcessor/req_ProcessBusinessEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/integ/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ProcessBusinessEventRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:BusinessEvent>
            <v91:Header>
               <v91:ModuleName/>
               <v91:ActionType/>
               <v91:ActionId/>
               <v91:PrimaryKey/>
               <v91:ParentActionId/>
               <v91:PublisherId/>
               <v91:CreatedDateTime/>
               <v91:HotelCode/>
            </v91:Header>
            <v91:Details>
               <v91:Detail>
                  <v91:DataElement/>
                  <v91:OldValue/>
                  <v91:NewValue/>
                  <v91:ScopeFrom/>
                  <v91:ScopeTo/>
                  <v91:ElementSequence/>
                  <v91:ElementType/>
                  <v91:ElementRole/>
                  <v91:HotelCode/>
               </v91:Detail>
            </v91:Details>
         </v9:BusinessEvent>
      </v9:ProcessBusinessEventRQ>
   </soapenv:Body>
</soapenv:Envelope>